tangyangguang/Esp32_Faucet/src/main.cpp
void initializeI2cBus() {
    Wire.begin(faucet::kPinI2cSda, faucet::kPinI2cScl);
    Wire.setTimeOut(kI2cTimeoutMs);
}

const char* configLoadStatusName(faucet::ConfigStore::LoadStatus status) {
    switch (status) {
        case faucet::ConfigStore::LoadStatus::Defaults:
            return "defaults";
        case faucet::ConfigStore::LoadStatus::LoadedCurrent:
            return "loaded_current";
    }
    return "unknown";
}

void logSystemConfigStatus() {
    const faucet::ConfigStore::LoadStatus status = g_configStore.lastSystemConfigLoadStatus();
    ESP32BASE_LOG_I("app",
                    "system config load status=%s raw_version=%ld target_version=%ld",
                    configLoadStatusName(status),
                    static_cast<long>(g_configStore.lastSystemConfigRawVersion()),
                    static_cast<long>(g_configStore.currentSystemConfigVersion()));
    if (status == faucet::ConfigStore::LoadStatus::Defaults &&
        g_configStore.lastSystemConfigRawVersion() != g_configStore.currentSystemConfigVersion()) {
        ESP32BASE_LOG_W("app", "system config version mismatch, defaults used until next save");
    }
}

void checkFileSystemCapacity() {
#if ESP32BASE_ENABLE_FS
    if (!Esp32BaseFs::isReady()) {
        return;
    }
    constexpr std::size_t kLowFreeBytes = 350UL * 1024UL;
    const std::size_t freeBytes = Esp32BaseFs::freeBytes();
    if (freeBytes < kLowFreeBytes) {
        ESP32BASE_LOG_W("app",
                        "LittleFS low free space: free=%lu total=%lu used=%lu",
                        static_cast<unsigned long>(freeBytes),
                        static_cast<unsigned long>(Esp32BaseFs::totalBytes()),
                        static_cast<unsigned long>(Esp32BaseFs::usedBytes()));
    }
#endif
}

std::uint32_t localSecondsFromUnix(std::uint32_t timestamp) {
    time_t value = static_cast<time_t>(timestamp);
    struct tm localTime {};
    localtime_r(&value, &localTime);
    const std::uint16_t year = static_cast<std::uint16_t>(localTime.tm_year + 1900);
    const std::uint8_t month = static_cast<std::uint8_t>(localTime.tm_mon + 1);
    const std::uint8_t day = static_cast<std::uint8_t>(localTime.tm_mday);
    return faucet::secondsSince2000(year,
                                    month,
                                    day,
                                    static_cast<std::uint8_t>(localTime.tm_hour),
                                    static_cast<std::uint8_t>(localTime.tm_min),
                                    static_cast<std::uint8_t>(localTime.tm_sec));
}

std::uint32_t currentSeconds() {
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot time = Esp32BaseNtp::snapshot();
    if (time.synced) {
        return localSecondsFromUnix(time.epochSec);
    }
    return time.uptimeSec;
#else
    return millis() / 1000UL;
#endif
}

std::uint32_t currentBootId() {
#if ESP32BASE_ENABLE_NTP
    return Esp32BaseNtp::snapshot().bootId;
#else
    return 0;
#endif
}

faucet::FaucetDisplayStatus currentDisplayStatus() {
    return faucet::FaucetDisplayStatus{g_lastColorDisplayFrame.on};
}

faucet::FaucetRuntimeDiagnostics currentRuntimeDiagnostics() {
    return faucet::FaucetRuntimeDiagnostics{g_maxLoopIntervalUs, g_maxAppTickUs, g_maxBaseHandleUs};
}

void applyValveOutput(faucet::ValveOutput output) {
    g_valveHardware.apply(output);
}

void requestRecordStoreRebuildAfterFormatFs() {
    g_rebuildRecordStoreAfterFormatFs = true;
}

void applyRuntimeSettings(const faucet::SystemConfig& config) {
    g_beep.setEnabled(config.beepEnabled);
    g_waterSensors.configure(config);
    if (g_colorDisplay) {
        g_colorDisplay->configure(config.displaySleepSec);
        g_colorDisplay->wake(millis());
    }
    g_st7789.begin();
}

bool currentPeriodKeys(std::uint32_t nowSeconds, faucet::PeriodKeys& keys) {
    if (nowSeconds >= faucet::kMinRealDateSeconds) {
        const std::uint32_t day = nowSeconds / 86400UL;
        std::uint16_t year = 0;
        std::uint8_t month = 0;
        std::uint8_t monthDay = 0;
        faucet::dateFromDayIndex(day, year, month, monthDay);
        const std::uint32_t dayKey =
            static_cast<std::uint32_t>(year) * 10000UL + static_cast<std::uint32_t>(month) * 100UL + monthDay;
        const std::uint32_t weekKey = nowSeconds / 86400UL / 7UL;
        const std::uint32_t monthKey = static_cast<std::uint32_t>(year) * 100UL + month;
        keys = faucet::PeriodKeys{dayKey, weekKey, monthKey};
        return true;
    }
    const faucet::RtcDateTime now = g_rtc.readNow();
    if (!now.valid) {
        keys = faucet::PeriodKeys{0, 0, 0};
        return false;
    }
    const std::uint32_t rtcSeconds =
        faucet::secondsSince2000(now.year, now.month, now.day, now.hour, now.minute, now.second);
    if (rtcSeconds < faucet::kMinRealDateSeconds) {
        keys = faucet::PeriodKeys{0, 0, 0};
        return false;
    }

    const std::uint32_t dayKey = static_cast<std::uint32_t>(now.year) * 10000UL +
                                 static_cast<std::uint32_t>(now.month) * 100UL + now.day;
    const std::uint32_t weekKey = faucet::daysSince2000(now.year, now.month, now.day) / 7UL;
    const std::uint32_t monthKey =
        static_cast<std::uint32_t>(now.year) * 100UL + static_cast<std::uint32_t>(now.month);
    keys = faucet::PeriodKeys{dayKey, weekKey, monthKey};
    return true;
}

void handleTimeSynced(const Esp32BaseNtp::TimeSnapshot& time);

void initializeApplication() {
    logStartupPhase("app_init_start");
    initializeI2cBus();
    logStartupPhase("i2c_ready");
    g_rtc.begin();
    logStartupPhase("rtc_ready");
    g_config = g_configStore.loadSystemConfig();
    g_waterSensors.configure(g_config);
    const bool waterSensorAdcReady = g_waterSensors.begin();
    ESP32BASE_LOG_I("app",
                    "water_sensor_adc=%s temp_gpio=%u tds_gpio=%u",
                    waterSensorAdcReady ? "ready" : "absent",
                    static_cast<unsigned>(faucet::kPinTemperatureAdc),
                    static_cast<unsigned>(faucet::kPinTdsAdc));
    logSystemConfigStatus();
    logStartupPhase("config_ready");
    g_configInitComplete = true;
    const std::uint32_t nowSeconds = currentSeconds();
    const bool waterRecordReady = g_waterRecordFile.begin();
    const bool meteringSchemesReady = g_meteringSchemes.begin();
    if (!meteringSchemesReady) {
        ESP32BASE_LOG_W("app", "metering scheme store unavailable, using config fallback");
    }
    const bool calibrationSessionReady = g_calibrationSession.begin();
    const bool calibrationSessionTracesReady = g_calibrationSessionTraces.begin();
    if (!calibrationSessionReady || !calibrationSessionTracesReady) {
        ESP32BASE_LOG_W("app", "guided calibration session storage unavailable");
    }
    g_recordStoreInitComplete = waterRecordReady && calibrationSessionReady;
    logStartupPhase("record_store_ready");
    g_pulseTraceRecords = new (std::nothrow) faucet::WaterPulseTrace[kPulseTraceCapacity]{};
    g_pulseTraceBuckets = new (std::nothrow) faucet::WaterPulseTraceBucketSample[kPulseTraceMaxBuckets]{};
    g_pulseTraceStartupEdges = new (std::nothrow) faucet::WaterPulseTraceSample[kPulseTraceMaxStartupEdges]{};
    if (g_pulseTraceRecords && g_pulseTraceBuckets && g_pulseTraceStartupEdges) {
        g_pulseTraces = new (std::nothrow) faucet::WaterPulseTraceStore(
            g_pulseTraceRecords,
            kPulseTraceCapacity,
            g_pulseTraceBuckets,
            kPulseTraceMaxBuckets,
            g_pulseTraceStartupEdges,
            kPulseTraceMaxStartupEdges,
            faucet::kRecentPulseTraceCount);
    }
    if (!g_pulseTraces) {
        ESP32BASE_LOG_W("app", "pulse trace store allocation failed, trace diagnostics disabled");
    }
    g_traceStoreInitComplete = g_pulseTraces && calibrationSessionTracesReady;
    logStartupPhase("trace_store_ready");
    checkFileSystemCapacity();
    faucet::PeriodKeys periodKeys{};
    currentPeriodKeys(nowSeconds, periodKeys);
    g_statistics = faucet::StatisticsStore(g_configStore.loadStatistics(periodKeys));
    faucet::FilterRuntime filterRuntime[faucet::kFilterCount]{};
    g_configStore.loadFilterRuntime(filterRuntime);
    g_runtimeStateInitComplete = true;
    logStartupPhase("runtime_state_ready");
    g_filters = new (std::nothrow) faucet::FilterStore(g_config.filters);
    if (!g_filters) {
        ESP32BASE_LOG_E("app", "filter store allocation failed");
        return;
    }
    g_filters->applyRuntime(filterRuntime);
    if (g_pulseTraces) {
        g_pulseTraces->setRecentTraceLimit(faucet::kRecentPulseTraceCount);
    }
    faucet::MeteringSchemeRecord activeScheme{};
    if (meteringSchemesReady && g_meteringSchemes.activeScheme(activeScheme)) {
        g_app = new (std::nothrow) faucet::AppController(
            g_config, activeScheme,
            g_statistics,
            *g_filters,
            g_recordWriter,
            g_meteringSchemes,
            g_pulseTraces,
            &g_calibrationSession,
            &g_calibrationSessionTraces,
            &g_waterSensors);
    } else {
        g_app = new (std::nothrow) faucet::AppController(
            g_config,
            g_statistics,
            *g_filters,
            g_recordWriter,
            g_pulseTraces,
            &g_calibrationSession,
            &g_calibrationSessionTraces,
            &g_waterSensors);
    }
    if (!g_app) {
        ESP32BASE_LOG_E("app", "app controller allocation failed");
        return;
    }
    g_appControllerInitComplete = true;
    g_colorDisplay = new (std::nothrow) faucet::ColorDisplayPresenter(g_config.displaySleepSec);
    if (!g_colorDisplay) {
        ESP32BASE_LOG_W("app", "color display presenter allocation failed, st7789 disabled");
    }
    faucet::setFaucetWebContext(
        faucet::FaucetWebContext{&g_config,
                                 &g_configStore,
                                 &g_statistics,
                                 g_app,
                                 g_filters,
                                 &g_waterRecordFile,
                                 &g_meteringSchemes,
                                 &g_calibrationSession,
                                 &g_calibrationSessionTraces,
                                 g_pulseTraces,
                                 currentSeconds,
                                 currentBootId,
                                 applyRuntimeSettings,
                                 requestRecordStoreRebuildAfterFormatFs,
                                 currentDisplayStatus,
                                 currentRuntimeDiagnostics});
    faucet::setFaucetAppConfigContext(
        faucet::FaucetAppConfigContext{&g_config, &g_configStore, g_app, applyRuntimeSettings});
#if ESP32BASE_ENABLE_NTP
    Esp32BaseNtp::onTimeSynced(handleTimeSynced);
#endif
    logStartupPhase("context_ready");

    g_buttons.begin();
    g_flowPulses.begin();
    g_valveHardware.begin();
    g_app->setValveOutputSink(applyValveOutput);
    const faucet::ValveOutput startupValve = g_app->snapshot().valve;
    g_valveHardware.apply(startupValve);
    g_valveClosedApplied =
        startupValve.state == faucet::ValveState::Closed && !startupValve.enabled && startupValve.dutyPercent == 0;
    g_beep.setEnabled(g_config.beepEnabled);
    g_beepHardware.begin();
    g_st7789.begin();
    logStartupPhase("hardware_ready");

    g_app->resetInputs(g_buttons.read(), millis());
    if (g_colorDisplay) {
        g_colorDisplay->wake(millis());
        g_lastColorDisplayFrame = g_colorDisplay->render(g_app->snapshot(), millis(), Esp32BaseWiFi::isConnected());
        g_st7789.apply(g_lastColorDisplayFrame);
    }
    logStartupPhase("display_ready");

    ESP32BASE_LOG_I("app",
                    "application initialized rtc=%s st7789=%s records=%s",
                    g_rtc.present() ? "present" : "absent",
                    g_st7789.present() ? "present" : "absent",
                    g_waterRecordFile.ready() ? "file" : "unavailable");
}

void handleTimeSynced(const Esp32BaseNtp::TimeSnapshot& time) {
#if ESP32BASE_ENABLE_NTP
    if (!time.synced || g_bootRelativeTimesRewritten || time.bootId == 0) {
        return;
    }
    std::uint32_t bootStartEpochSec = 0;
    if (!Esp32BaseNtp::resolveCurrentBootEvent(time.bootId, 0, &bootStartEpochSec)) {
        return;
    }
    const std::uint32_t bootStartRealSec = localSecondsFromUnix(bootStartEpochSec);
    const std::size_t recordCount = g_waterRecordFile.rewriteBootRelativeTimes(time.bootId, bootStartRealSec);
    bool filtersChanged = false;
    if (g_filters) {
        for (std::size_t i = 0; i < faucet::kFilterCount; ++i) {
            faucet::FilterRecord record = g_filters->record(i);
            if (record.startBootId == time.bootId && record.startTime > 0 &&
                record.startTime < faucet::kMinRealDateSeconds) {
                std::uint32_t eventEpochSec = 0;
                if (!Esp32BaseNtp::resolveCurrentBootEvent(record.startBootId, record.startTime, &eventEpochSec)) {
                    continue;
                }
                record.startTime = localSecondsFromUnix(eventEpochSec);
                record.startBootId = 0;
                g_filters->updateFilter(i, record);
                filtersChanged = true;
            }
        }
    }
    if (filtersChanged) {
        faucet::FilterRuntime filterRuntime[faucet::kFilterCount]{};
        g_filters->copyRuntime(filterRuntime);
        if (!g_configStore.saveFilterRuntime(filterRuntime)) {
            ESP32BASE_LOG_E("app", "filter time correction persistence failed");
        }
    }
    if (recordCount > 0 || filtersChanged) {
        ESP32BASE_LOG_I("app",
                        "boot_relative_times_rewritten boot_id=%lu records=%lu filters=%s",
                        static_cast<unsigned long>(time.bootId),
                        static_cast<unsigned long>(recordCount),
                        filtersChanged ? "yes" : "no");
    }
    g_bootRelativeTimesRewritten = true;
#else
    (void)time;
#endif
}

void runApplicationTick() {
    if (!g_app) {
        return;
    }

    if (g_rebuildRecordStoreAfterFormatFs) {
        g_rebuildRecordStoreAfterFormatFs = false;
        if (!g_waterRecordFile.begin()) {
            ESP32BASE_LOG_E("app", "record store rebuild after fs format failed");
        }
    }

    const bool cancelInterruptPending = g_buttons.consumeCancelInterrupt();
    const std::uint32_t nowMs = millis();
    const std::uint32_t nowUs = micros();
    if (cancelInterruptPending) {
        g_app->emergencyStop(nowMs);
    }
    const faucet::ButtonLevels levels = g_buttons.read();

    std::uint32_t pulseUs = 0;
    std::size_t processedPulses = 0;
    while (processedPulses < kMaxFlowPulsesPerTick && g_flowPulses.pop(pulseUs)) {
        g_app->onFlowPulse(pulseUs);
        ++processedPulses;
    }
    const std::uint32_t droppedPulses = g_flowPulses.droppedPulses();
    g_app->setFlowDroppedPulses(droppedPulses);
    if (droppedPulses != g_lastDroppedPulsesLogged &&
        faucet::elapsedAtLeast(nowMs, g_lastDroppedPulsesLogMs, 5000UL)) {
        ESP32BASE_LOG_W("app",
                        "flow pulse buffer dropped pulses: total=%lu delta=%lu",
                        static_cast<unsigned long>(droppedPulses),
                        static_cast<unsigned long>(droppedPulses - g_lastDroppedPulsesLogged));
        g_lastDroppedPulsesLogged = droppedPulses;
        g_lastDroppedPulsesLogMs = nowMs;
    }

