tangyangguang/Esp32_Faucet/src/main.cpp
    const std::uint32_t nowSeconds = currentSeconds();
    faucet::PeriodKeys periodKeys{};
    const bool periodKeysValid = currentPeriodKeys(nowSeconds, periodKeys);
    const faucet::AppTickInput input{
        levels,
        nowMs,
        nowUs,
        nowSeconds,
        periodKeys,
        periodKeysValid,
        nowSeconds >= faucet::kMinRealDateSeconds,
        currentBootId(),
    };
    g_app->tick(input);
    const faucet::BeepPattern beep = g_app->consumeBeepPattern();
    if (beep != faucet::BeepPattern::None) {
        g_beep.play(beep, nowMs);
    }

    const faucet::AppSnapshot snapshot = g_app->snapshot();
    g_valveHardware.apply(snapshot.valve);

    const bool userActivity =
        levels.cancelPressed || levels.okPressed || levels.plusPressed || levels.minusPressed;
    if (g_colorDisplay && (userActivity || snapshot.water.state != faucet::WaterState::Idle ||
                           snapshot.localMode != faucet::LocalUiMode::Normal)) {
        g_colorDisplay->wake(nowMs);
    }
    if (g_colorDisplay && faucet::elapsedAtLeast(nowMs, g_lastColorDisplayMs, 500UL)) {
        g_lastColorDisplayFrame = g_colorDisplay->render(snapshot, nowMs, Esp32BaseWiFi::isConnected());
        g_st7789.apply(g_lastColorDisplayFrame);
        g_lastColorDisplayMs = nowMs;
    }

    const bool runtimePersistenceRetryDue =
        !g_runtimePersistenceRetryActive ||
        faucet::elapsedAtLeast(nowMs, g_lastRuntimePersistenceFailureMs, kRuntimePersistenceRetryIntervalMs);
    if (runtimePersistenceRetryDue && g_app->consumePersistenceDirty() && g_filters) {
        ESP32BASE_LOG_I("app", "runtime_persistence_begin");
        faucet::FilterRuntime filterRuntime[faucet::kFilterCount]{};
        g_filters->copyRuntime(filterRuntime);
        const bool ok = g_configStore.saveStatistics(g_statistics.record()) &&
                        g_configStore.saveFilterRuntime(filterRuntime);
        ESP32BASE_LOG_I("app", "runtime_persistence_done ok=%s", ok ? "yes" : "no");
        if (!ok && !g_persistenceFailureLogged) {
            ESP32BASE_LOG_E("app", "runtime persistence failed");
            g_persistenceFailureLogged = true;
        }
        if (!ok) {
            g_app->markPersistenceDirtyForRetry();
            g_runtimePersistenceRetryActive = true;
            g_lastRuntimePersistenceFailureMs = nowMs;
        } else {
            g_persistenceFailureLogged = false;
            g_runtimePersistenceRetryActive = false;
        }
    }

    if (g_app->consumeConfigDirty()) {
        g_config = g_app->config();
        if (!g_configStore.saveSystemConfig(g_config)) {
            ESP32BASE_LOG_E("app", "system config persistence failed");
        }
    }

    g_beep.tick(nowMs);
    g_beepHardware.apply(g_beep.output());
}

bool startupHealthReadyForOtaMarkValid() {
    return g_baseBeginComplete &&
           g_littleFsInitComplete &&
           g_configInitComplete &&
           g_recordStoreInitComplete &&
           g_traceStoreInitComplete &&
           g_runtimeStateInitComplete &&
           g_appControllerInitComplete &&
           g_valveClosedApplied;
}

void maybeMarkOtaValidAfterHealthCheck() {
#if ESP32BASE_OTA_REQUIRE_MARK_VALID
    if (g_otaMarkValidAttempted || !Esp32BaseOta::waitingForMarkValid()) {
        return;
    }
    if (!startupHealthReadyForOtaMarkValid()) {
        return;
    }
    ESP32BASE_LOG_I("app", "ota_health_check begin");
    g_otaMarkValidAttempted = true;
    if (Esp32BaseOta::markCurrentValid()) {
        ESP32BASE_LOG_I("app", "ota_mark_valid ok");
    } else {
        ESP32BASE_LOG_E("app", "ota_mark_valid failed");
    }
#endif
}
}  // namespace

void setup() {
    Serial.begin(115200);
    delay(200);
    configureBase();

    g_baseBeginComplete = Esp32Base::begin();
    if (!g_baseBeginComplete) {
        ESP32BASE_LOG_E("app", "Esp32Base begin failed: %s", Esp32Base::lastError());
    }
#if ESP32BASE_ENABLE_FS
    g_littleFsInitComplete = Esp32BaseFs::isReady();
#else
    g_littleFsInitComplete = true;
#endif
    initializeApplication();
}

void loop() {
    const std::uint32_t loopStartUs = micros();
    if (g_lastLoopStartUs != 0) {
        g_maxLoopIntervalUs = std::max(g_maxLoopIntervalUs, faucet::elapsedSince(loopStartUs, g_lastLoopStartUs));
    }
    g_lastLoopStartUs = loopStartUs;

    const std::uint32_t appTickStartUs = micros();
    runApplicationTick();
    g_maxAppTickUs = std::max(g_maxAppTickUs, faucet::elapsedSince(micros(), appTickStartUs));

    const std::uint32_t baseHandleStartUs = micros();
    Esp32Base::handle();
    g_maxBaseHandleUs = std::max(g_maxBaseHandleUs, faucet::elapsedSince(micros(), baseHandleStartUs));
    maybeMarkOtaValidAfterHealthCheck();
    delay(1);
}
